kpd = {
    'bearings': 0.99,  # одна пара подшипников
    'coupling': 1,  # муфта
    'chain': 0.91,  # цепная передача (открытая)
    'belt': 0.95,  # ременная передача (открытая)
    'gear': 0.94,  # зубчатая передача (открытая)
    'cylindrical': 0.97,  # цилиндрическая передача (закрытая)
    'bevel': 0.96,  # коническая передача (закрытая)
    'worm ': 0.7,  # червячная передача (закрытая)
}

recommendation_gear_ratio = {
    'chain': 3,  # цепная передача (открытая)
    'belt': 2.5,  # ременная передача (открытая)
    'gear': 4,  # зубчатая передача (открытая)
    'cylindrical': 4,  # цилиндрическая передача (закрытая)
    'bevel': 3,  # коническая передача (закрытая)
    'worm ': 25,  # червячная передача (закрытая)
}
